Tekla Open API Reference for Tekla Structures 2025
Integer Implicit Conversion (Integer to Int32)
 Converts from Datatype.Integer to int.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static implicit operator int (
	Integer From
)
Public Shared Widening Operator CType (
	From As Integer
) As Integer
Parameters
From
Type: Tekla.Structures.Datatype.Integer
The value to be converted.
Return Value
Type: Int32
The converted int value.
See Also
Reference
Integer Structure
Implicit Overload
Tekla.Structures.Datatype Namespace